# простой цикл где счётчик НЕ участвует в алгоритме
# i = 0

# while i < 5:
#     print("hello")
#     i = i + 1


# простой цикл где счётчик Участвует в алгоритме
# sum = 0
# i = 1

# while i <= 10:
#     sum = sum + i
#     i = i + 1

# print(f"sum = {sum}")

# простой цикл без заранее заданного количества повторений
# import math

# number = -1

# while number <= 0:
#     number = int(input("введите число из которого хотите излечь квадраный корень: "))
#     if number <= 0:
#         print("Ошибка ввода. Число должно быть больше 0")

# print(f"квадратный корень = {math.sqrt(number)}")
